#include <stdio.h>
#include <locale.h>
int main()
{
	setlocale(LC_CTYPE, "RUS");
	pr3();
}
int pr1()
{
	printf("123\n"); // подзадание 1
	printf("1\n2\n3\n"); // подзадание 2
	printf("1\n	2\n		3\n"); // подзадание 3
	printf("%d\n,%d\n ,%d\n  ,%d\n", 1, 2, 3, 4); // подзадание 4
	printf("%10.3f\n", 12.234657);  // подзадание 5
	printf("%10.5f\n", 12.234657);  // подзадание 6
	printf("Остаток от деления %d на %d равен %d\n", 5, 2, 5 % 2);
	printf("Остаток от деления %d на %d равен %d\n", 7, 5, 7 % 5);
	printf("Умножение %d на %d равен %d\n", 2000, 4, 2000 * 4);
	printf("%g разделить %e равно %f\n", 5., 2000000., 5. / 2000000);
	printf("%d разделить %d равно %d\n", 5., 2000000., 5. / 2000000);
	printf("%f разделить %f равно %f\n", 5., 2000000., 5. / 2000000);
	printf("%g разделить %g равно %g\n", 5., 2000000., 5. / 2000000);
	printf("%e разделить %e равно %e\n", 5., 2000000., 5. / 2000000);
	return 0;
}
int pr2()
{
	int N = 15, K = 30;
	printf("Сейчас %d часов %d минут 00 секунд\n", N, K);
	printf("Идёт %d минута суток\n", K);
	printf("До полуночи осталось %d часов и %d минут\n", N, K);
	printf("С 8:00 прошло 00 секунд\n");
	printf("Текущий час  = %f суток  и текущая минута = %f часа", N / 24., K / 60.);
	return 0;
}


int pr3()
{
	int n = 4, L = 433, k = 5, m = 1;
	printf("Дано:\n	 %d\n	 %d\n	_________\nОтвет:\n	+%0*.*f", n, L, k, m, 4 / 433.);
	return 0;
}
